Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32CM-JH_DFP/1.1.203/PIC32CM-JH01/include/pio/pic32cm2532jh01100.h
#define PIN_PB23G_CAN0_RX                          _UINT32_(55)
#define MUX_PB23G_CAN0_RX                          _UINT32_(6) 
#define PINMUX_PB23G_CAN0_RX                       ((PIN_PB23G_CAN0_RX << 16) | MUX_PB23G_CAN0_RX)
#define PORT_PB23G_CAN0_RX                         (_UINT32_(1) << 23)

#define PIN_PA24G_CAN0_TX                          _UINT32_(24)
#define MUX_PA24G_CAN0_TX                          _UINT32_(6) 
#define PINMUX_PA24G_CAN0_TX                       ((PIN_PA24G_CAN0_TX << 16) | MUX_PA24G_CAN0_TX)
#define PORT_PA24G_CAN0_TX                         (_UINT32_(1) << 24)

#define PIN_PB22G_CAN0_TX                          _UINT32_(54)
#define MUX_PB22G_CAN0_TX                          _UINT32_(6) 
#define PINMUX_PB22G_CAN0_TX                       ((PIN_PB22G_CAN0_TX << 16) | MUX_PB22G_CAN0_TX)
#define PORT_PB22G_CAN0_TX                         (_UINT32_(1) << 22)

/* ========== PORT definition for CAN1 peripheral ========== */
#define PIN_PB11G_CAN1_RX                          _UINT32_(43)
#define MUX_PB11G_CAN1_RX                          _UINT32_(6) 
#define PINMUX_PB11G_CAN1_RX                       ((PIN_PB11G_CAN1_RX << 16) | MUX_PB11G_CAN1_RX)
#define PORT_PB11G_CAN1_RX                         (_UINT32_(1) << 11)

#define PIN_PB15G_CAN1_RX                          _UINT32_(47)
#define MUX_PB15G_CAN1_RX                          _UINT32_(6) 
#define PINMUX_PB15G_CAN1_RX                       ((PIN_PB15G_CAN1_RX << 16) | MUX_PB15G_CAN1_RX)
#define PORT_PB15G_CAN1_RX                         (_UINT32_(1) << 15)

#define PIN_PB10G_CAN1_TX                          _UINT32_(42)
#define MUX_PB10G_CAN1_TX                          _UINT32_(6) 
#define PINMUX_PB10G_CAN1_TX                       ((PIN_PB10G_CAN1_TX << 16) | MUX_PB10G_CAN1_TX)
#define PORT_PB10G_CAN1_TX                         (_UINT32_(1) << 10)

#define PIN_PB14G_CAN1_TX                          _UINT32_(46)
#define MUX_PB14G_CAN1_TX                          _UINT32_(6) 
#define PINMUX_PB14G_CAN1_TX                       ((PIN_PB14G_CAN1_TX << 16) | MUX_PB14G_CAN1_TX)
#define PORT_PB14G_CAN1_TX                         (_UINT32_(1) << 14)

/* ========== PORT definition for CCL peripheral ========== */
#define PIN_PA04I_CCL_IN0                          _UINT32_(4) 
#define MUX_PA04I_CCL_IN0                          _UINT32_(8) 
#define PINMUX_PA04I_CCL_IN0                       ((PIN_PA04I_CCL_IN0 << 16) | MUX_PA04I_CCL_IN0)
#define PORT_PA04I_CCL_IN0                         (_UINT32_(1) << 4)

#define PIN_PA16I_CCL_IN0                          _UINT32_(16)
#define MUX_PA16I_CCL_IN0                          _UINT32_(8) 
#define PINMUX_PA16I_CCL_IN0                       ((PIN_PA16I_CCL_IN0 << 16) | MUX_PA16I_CCL_IN0)
#define PORT_PA16I_CCL_IN0                         (_UINT32_(1) << 16)

#define PIN_PB22I_CCL_IN0                          _UINT32_(54)
#define MUX_PB22I_CCL_IN0                          _UINT32_(8) 
#define PINMUX_PB22I_CCL_IN0                       ((PIN_PB22I_CCL_IN0 << 16) | MUX_PB22I_CCL_IN0)
#define PORT_PB22I_CCL_IN0                         (_UINT32_(1) << 22)

#define PIN_PA05I_CCL_IN1                          _UINT32_(5) 
#define MUX_PA05I_CCL_IN1                          _UINT32_(8) 
#define PINMUX_PA05I_CCL_IN1                       ((PIN_PA05I_CCL_IN1 << 16) | MUX_PA05I_CCL_IN1)
#define PORT_PA05I_CCL_IN1                         (_UINT32_(1) << 5)

#define PIN_PA17I_CCL_IN1                          _UINT32_(17)
#define MUX_PA17I_CCL_IN1                          _UINT32_(8) 
#define PINMUX_PA17I_CCL_IN1                       ((PIN_PA17I_CCL_IN1 << 16) | MUX_PA17I_CCL_IN1)
#define PORT_PA17I_CCL_IN1                         (_UINT32_(1) << 17)

#define PIN_PB00I_CCL_IN1                          _UINT32_(32)
#define MUX_PB00I_CCL_IN1                          _UINT32_(8) 
#define PINMUX_PB00I_CCL_IN1                       ((PIN_PB00I_CCL_IN1 << 16) | MUX_PB00I_CCL_IN1)
#define PORT_PB00I_CCL_IN1                         (_UINT32_(1) << 0)

#define PIN_PA06I_CCL_IN2                          _UINT32_(6) 
#define MUX_PA06I_CCL_IN2                          _UINT32_(8) 
#define PINMUX_PA06I_CCL_IN2                       ((PIN_PA06I_CCL_IN2 << 16) | MUX_PA06I_CCL_IN2)
#define PORT_PA06I_CCL_IN2                         (_UINT32_(1) << 6)

#define PIN_PA18I_CCL_IN2                          _UINT32_(18)
#define MUX_PA18I_CCL_IN2                          _UINT32_(8) 
#define PINMUX_PA18I_CCL_IN2                       ((PIN_PA18I_CCL_IN2 << 16) | MUX_PA18I_CCL_IN2)
#define PORT_PA18I_CCL_IN2                         (_UINT32_(1) << 18)

#define PIN_PB01I_CCL_IN2                          _UINT32_(33)
#define MUX_PB01I_CCL_IN2                          _UINT32_(8) 
#define PINMUX_PB01I_CCL_IN2                       ((PIN_PB01I_CCL_IN2 << 16) | MUX_PB01I_CCL_IN2)
#define PORT_PB01I_CCL_IN2                         (_UINT32_(1) << 1)

#define PIN_PA08I_CCL_IN3                          _UINT32_(8) 
#define MUX_PA08I_CCL_IN3                          _UINT32_(8) 
#define PINMUX_PA08I_CCL_IN3                       ((PIN_PA08I_CCL_IN3 << 16) | MUX_PA08I_CCL_IN3)
#define PORT_PA08I_CCL_IN3                         (_UINT32_(1) << 8)

#define PIN_PA30I_CCL_IN3                          _UINT32_(30)
#define MUX_PA30I_CCL_IN3                          _UINT32_(8) 
#define PINMUX_PA30I_CCL_IN3                       ((PIN_PA30I_CCL_IN3 << 16) | MUX_PA30I_CCL_IN3)
#define PORT_PA30I_CCL_IN3                         (_UINT32_(1) << 30)

#define PIN_PA09I_CCL_IN4                          _UINT32_(9) 
#define MUX_PA09I_CCL_IN4                          _UINT32_(8) 
#define PINMUX_PA09I_CCL_IN4                       ((PIN_PA09I_CCL_IN4 << 16) | MUX_PA09I_CCL_IN4)
#define PORT_PA09I_CCL_IN4                         (_UINT32_(1) << 9)

#define PIN_PC27I_CCL_IN4                          _UINT32_(91)
#define MUX_PC27I_CCL_IN4                          _UINT32_(8) 
#define PINMUX_PC27I_CCL_IN4                       ((PIN_PC27I_CCL_IN4 << 16) | MUX_PC27I_CCL_IN4)
#define PORT_PC27I_CCL_IN4                         (_UINT32_(1) << 27)

#define PIN_PA10I_CCL_IN5                          _UINT32_(10)
#define MUX_PA10I_CCL_IN5                          _UINT32_(8) 
#define PINMUX_PA10I_CCL_IN5                       ((PIN_PA10I_CCL_IN5 << 16) | MUX_PA10I_CCL_IN5)
#define PORT_PA10I_CCL_IN5                         (_UINT32_(1) << 10)

