Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32CM-JH_DFP/1.1.203/PIC32CM-JH01/include/pio/pic32cm2532jh01100.h
#define PIN_PC09C_SERCOM6_PAD1                     _UINT32_(73)
#define MUX_PC09C_SERCOM6_PAD1                     _UINT32_(2) 
#define PINMUX_PC09C_SERCOM6_PAD1                  ((PIN_PC09C_SERCOM6_PAD1 << 16) | MUX_PC09C_SERCOM6_PAD1)
#define PORT_PC09C_SERCOM6_PAD1                    (_UINT32_(1) << 9)

#define PIN_PC17C_SERCOM6_PAD1                     _UINT32_(81)
#define MUX_PC17C_SERCOM6_PAD1                     _UINT32_(2) 
#define PINMUX_PC17C_SERCOM6_PAD1                  ((PIN_PC17C_SERCOM6_PAD1 << 16) | MUX_PC17C_SERCOM6_PAD1)
#define PORT_PC17C_SERCOM6_PAD1                    (_UINT32_(1) << 17)

#define PIN_PC10C_SERCOM6_PAD2                     _UINT32_(74)
#define MUX_PC10C_SERCOM6_PAD2                     _UINT32_(2) 
#define PINMUX_PC10C_SERCOM6_PAD2                  ((PIN_PC10C_SERCOM6_PAD2 << 16) | MUX_PC10C_SERCOM6_PAD2)
#define PORT_PC10C_SERCOM6_PAD2                    (_UINT32_(1) << 10)

#define PIN_PC18C_SERCOM6_PAD2                     _UINT32_(82)
#define MUX_PC18C_SERCOM6_PAD2                     _UINT32_(2) 
#define PINMUX_PC18C_SERCOM6_PAD2                  ((PIN_PC18C_SERCOM6_PAD2 << 16) | MUX_PC18C_SERCOM6_PAD2)
#define PORT_PC18C_SERCOM6_PAD2                    (_UINT32_(1) << 18)

#define PIN_PC05C_SERCOM6_PAD3                     _UINT32_(69)
#define MUX_PC05C_SERCOM6_PAD3                     _UINT32_(2) 
#define PINMUX_PC05C_SERCOM6_PAD3                  ((PIN_PC05C_SERCOM6_PAD3 << 16) | MUX_PC05C_SERCOM6_PAD3)
#define PORT_PC05C_SERCOM6_PAD3                    (_UINT32_(1) << 5)

#define PIN_PC11C_SERCOM6_PAD3                     _UINT32_(75)
#define MUX_PC11C_SERCOM6_PAD3                     _UINT32_(2) 
#define PINMUX_PC11C_SERCOM6_PAD3                  ((PIN_PC11C_SERCOM6_PAD3 << 16) | MUX_PC11C_SERCOM6_PAD3)
#define PORT_PC11C_SERCOM6_PAD3                    (_UINT32_(1) << 11)

#define PIN_PC19C_SERCOM6_PAD3                     _UINT32_(83)
#define MUX_PC19C_SERCOM6_PAD3                     _UINT32_(2) 
#define PINMUX_PC19C_SERCOM6_PAD3                  ((PIN_PC19C_SERCOM6_PAD3 << 16) | MUX_PC19C_SERCOM6_PAD3)
#define PORT_PC19C_SERCOM6_PAD3                    (_UINT32_(1) << 19)

/* ========== PORT definition for SERCOM7 peripheral ========== */
#define PIN_PC16D_SERCOM7_PAD0                     _UINT32_(80)
#define MUX_PC16D_SERCOM7_PAD0                     _UINT32_(3) 
#define PINMUX_PC16D_SERCOM7_PAD0                  ((PIN_PC16D_SERCOM7_PAD0 << 16) | MUX_PC16D_SERCOM7_PAD0)
#define PORT_PC16D_SERCOM7_PAD0                    (_UINT32_(1) << 16)

#define PIN_PC12C_SERCOM7_PAD0                     _UINT32_(76)
#define MUX_PC12C_SERCOM7_PAD0                     _UINT32_(2) 
#define PINMUX_PC12C_SERCOM7_PAD0                  ((PIN_PC12C_SERCOM7_PAD0 << 16) | MUX_PC12C_SERCOM7_PAD0)
#define PORT_PC12C_SERCOM7_PAD0                    (_UINT32_(1) << 12)

#define PIN_PC17D_SERCOM7_PAD1                     _UINT32_(81)
#define MUX_PC17D_SERCOM7_PAD1                     _UINT32_(3) 
#define PINMUX_PC17D_SERCOM7_PAD1                  ((PIN_PC17D_SERCOM7_PAD1 << 16) | MUX_PC17D_SERCOM7_PAD1)
#define PORT_PC17D_SERCOM7_PAD1                    (_UINT32_(1) << 17)

#define PIN_PC13C_SERCOM7_PAD1                     _UINT32_(77)
#define MUX_PC13C_SERCOM7_PAD1                     _UINT32_(2) 
#define PINMUX_PC13C_SERCOM7_PAD1                  ((PIN_PC13C_SERCOM7_PAD1 << 16) | MUX_PC13C_SERCOM7_PAD1)
#define PORT_PC13C_SERCOM7_PAD1                    (_UINT32_(1) << 13)

#define PIN_PC18D_SERCOM7_PAD2                     _UINT32_(82)
#define MUX_PC18D_SERCOM7_PAD2                     _UINT32_(3) 
#define PINMUX_PC18D_SERCOM7_PAD2                  ((PIN_PC18D_SERCOM7_PAD2 << 16) | MUX_PC18D_SERCOM7_PAD2)
#define PORT_PC18D_SERCOM7_PAD2                    (_UINT32_(1) << 18)

#define PIN_PC14C_SERCOM7_PAD2                     _UINT32_(78)
#define MUX_PC14C_SERCOM7_PAD2                     _UINT32_(2) 
#define PINMUX_PC14C_SERCOM7_PAD2                  ((PIN_PC14C_SERCOM7_PAD2 << 16) | MUX_PC14C_SERCOM7_PAD2)
#define PORT_PC14C_SERCOM7_PAD2                    (_UINT32_(1) << 14)

#define PIN_PC19D_SERCOM7_PAD3                     _UINT32_(83)
#define MUX_PC19D_SERCOM7_PAD3                     _UINT32_(3) 
#define PINMUX_PC19D_SERCOM7_PAD3                  ((PIN_PC19D_SERCOM7_PAD3 << 16) | MUX_PC19D_SERCOM7_PAD3)
#define PORT_PC19D_SERCOM7_PAD3                    (_UINT32_(1) << 19)

#define PIN_PC15C_SERCOM7_PAD3                     _UINT32_(79)
#define MUX_PC15C_SERCOM7_PAD3                     _UINT32_(2) 
#define PINMUX_PC15C_SERCOM7_PAD3                  ((PIN_PC15C_SERCOM7_PAD3 << 16) | MUX_PC15C_SERCOM7_PAD3)
#define PORT_PC15C_SERCOM7_PAD3                    (_UINT32_(1) << 15)

/* ========== PORT definition for TC0 peripheral ========== */
#define PIN_PA22E_TC0_WO0                          _UINT32_(22)
#define MUX_PA22E_TC0_WO0                          _UINT32_(4) 
#define PINMUX_PA22E_TC0_WO0                       ((PIN_PA22E_TC0_WO0 << 16) | MUX_PA22E_TC0_WO0)
#define PORT_PA22E_TC0_WO0                         (_UINT32_(1) << 22)

#define PIN_PB08E_TC0_WO0                          _UINT32_(40)
#define MUX_PB08E_TC0_WO0                          _UINT32_(4) 
#define PINMUX_PB08E_TC0_WO0                       ((PIN_PB08E_TC0_WO0 << 16) | MUX_PB08E_TC0_WO0)
#define PORT_PB08E_TC0_WO0                         (_UINT32_(1) << 8)

#define PIN_PB12E_TC0_WO0                          _UINT32_(44)
#define MUX_PB12E_TC0_WO0                          _UINT32_(4) 
#define PINMUX_PB12E_TC0_WO0                       ((PIN_PB12E_TC0_WO0 << 16) | MUX_PB12E_TC0_WO0)
#define PORT_PB12E_TC0_WO0                         (_UINT32_(1) << 12)

#define PIN_PA23E_TC0_WO1                          _UINT32_(23)
#define MUX_PA23E_TC0_WO1                          _UINT32_(4) 
#define PINMUX_PA23E_TC0_WO1                       ((PIN_PA23E_TC0_WO1 << 16) | MUX_PA23E_TC0_WO1)
#define PORT_PA23E_TC0_WO1                         (_UINT32_(1) << 23)

#define PIN_PB09E_TC0_WO1                          _UINT32_(41)
#define MUX_PB09E_TC0_WO1                          _UINT32_(4) 
#define PINMUX_PB09E_TC0_WO1                       ((PIN_PB09E_TC0_WO1 << 16) | MUX_PB09E_TC0_WO1)
#define PORT_PB09E_TC0_WO1                         (_UINT32_(1) << 9)

#define PIN_PB13E_TC0_WO1                          _UINT32_(45)
#define MUX_PB13E_TC0_WO1                          _UINT32_(4) 
#define PINMUX_PB13E_TC0_WO1                       ((PIN_PB13E_TC0_WO1 << 16) | MUX_PB13E_TC0_WO1)
#define PORT_PB13E_TC0_WO1                         (_UINT32_(1) << 13)

/* ========== PORT definition for TC1 peripheral ========== */
#define PIN_PA24E_TC1_WO0                          _UINT32_(24)
#define MUX_PA24E_TC1_WO0                          _UINT32_(4) 
#define PINMUX_PA24E_TC1_WO0                       ((PIN_PA24E_TC1_WO0 << 16) | MUX_PA24E_TC1_WO0)
#define PORT_PA24E_TC1_WO0                         (_UINT32_(1) << 24)

